package com.example.tabactivity.logic

object MessageGreeting {
    fun getMessage(weatherCon:String,name:String,city:String):String{
        return when(weatherCon){
            "CLEAR_DAY" -> listOf<String>("早安，$name，清新的空气，快乐的气息，透过空气射入你的灵魂里；将阳光呼吸，将幸福抱起，泡一杯甜蜜的咖啡，接受祝福的信息，祝今天的你温馨无比！",
                "${name}，我看见${city}最近高温徘徊暑气难消，出门在外可要注意防暑呀。",
                "亲爱的${name}，今天天气真好啊。愿温暖的阳光和我的祝福伴你开心每一天。",
                "${name}，我看见${city}最近昼夜温差大。午间需防晒，早晚要防凉，千万记住啦。").random()

            "CLEAR_NIGHT" -> listOf<String>("${name}，今天辛苦了，结束了白天的繁忙，这样舒适的夜晚很适合去散散步呢。",
            "晚安，${name}，希望美好的夜晚和我的关怀都能温暖你的梦。").random()

            "PARTLY_CLOUDY_DAY" -> listOf<String>("$name，今天的天气是多云，没有太阳的炙热，也没有雨水的潮湿，风凉凉的吹在身上很舒服，真是让人喜欢的天气呢，要不多出去逛逛吧，我陪你。"
                ,"多云的天气，是太阳在云朵周围跟人类玩捉迷藏。$name，今天的你也要开心啊。").random()

            "PARTLY_CLOUDY_NIGHT" -> listOf<String>("${name}，${city}最近昼夜温差大，今晚要多穿点衣服，可不要着凉啊。",
                    "夜晚厚重的云朵如同我对你沉沉的思念，晚安啦$name，希望你的梦里也有我。").random()

            "CLOUDY" -> listOf<String>("愿我的关怀能驱散空中的阴霾，$name，阴天也要保持心情晴朗啊。",
                "$name，今天的${city}是阴天呢，可能会下雨，外出记得备伞啊。").random()

            "WIND" -> listOf<String>("外面风好大我好害怕，需要${name}陪我我才能好起来！",
                "$name，今天${city}有大风，放置在阳台、窗台的杂物记得妥善收好哦。",
                "${name}，今天风力偏大，空气干燥，注意保湿和防尘。").random()

            "LIGHT_RAIN" -> listOf<String>("$name，今天路面湿滑，开车出行千万要小心驾驶。",
            "$name，最近${city}阴雨连绵，出行记得带伞啊。伤风感冒多发，要注意随气温变化及时增减衣服。",
                "小雨飘飘似牛毛，飘走忧愁没烦恼；细雨绵绵入花针，绣出锦绣和良辰；雨花雨露像细丝，编织吉祥和如意。下雨啦，亲爱的${name}，愿你雨天心情好，欢喜又热闹。").random()


            "MODERN_RAIN" -> listOf<String>("$name，${city}今天有中雨，出行记得带伞，路上要注意安全。",
                "$name，最近有雷电，注意保护好家中的电器，以避免安全隐患。",
                "亲爱的$name，风雨交加也不能阻止我传送祝福的热情，狂风暴雨也无法压住我思念你的力量，在雨水不断的日子，我的心意也不停歇，祝你快乐每一天。").random()

            "HEAVY_RAIN" -> listOf<String>("亲爱的$name，一场雨，滴答滴，是否你又不开心；不快乐，又何必，烦恼终究要过去；雨过后，天放晴，心中也会现彩虹；快乐飞，更乐天，幸福围绕你身边。下雨的日子，我送你祝愿，给你幸福每一天。",
                "亲爱的$name，昨天的雨，冲走你的忧伤；今天的雨；滋润你的心房；明天的雨，带来事业辉煌；无论大雨暴雨，愿你心情舒畅，祝你天天开心，身体永远健康。",
                "亲爱的$name，滴滴喜雨，为你带来欢乐和如意；绵绵细雨，为你带来好运气；倾盆大雨，冲去所有的烦恼和忧愁，带给你美美的心情。下雨天，愿你不烦不恼不生气，开心快乐心情怡！").random()

            "STORM_RAIN" -> listOf<String>("风叫叫，雨跳跳，财神即刻送元宝，望${name}雨天不必烦恼，笑看好运连连来到！",
                "有一种心情叫做‘雨过天晴’，有一种友情能够‘风雨同舟’，有一种成功犹如‘雨后春笋’，有一种祝福‘风雨无阻’，下雨了，愿${name}雨天心情快乐，幸福围绕。",
                "雨天是个好时节，爱情的花朵经过风雨的洗礼而更加鲜艳、事业的大经雨天的浇灌而更加茁壮、心灵经雨天的洗礼而更加焕然一新。祝${name}雨天有个好心情。").random()

            "THUNDER_SHOWER" -> listOf<String>("风飘飘，雨潇潇，好运立刻就来到，亲爱的$name，不要忘记带伞哦！",
                "风摇摇，雨条条，幸运喜欢跟你跑，亲爱的${name}，${city}天气雷阵雨，出门请注意安全。").random()

            "SLEET" -> listOf<String>("滴答，是雨点，飘洒，是雪花，雨带着雪，雪含着雨，好一场美丽的雨夹雪，亲爱的$name，不要忘记带伞哦！").random()

            "LIGHT_SNOW" -> listOf<String>("雪花飘，飘来了吉祥和安康，雪花舞，舞出了幸福和快乐，亲爱的${name}在欣赏雪景的同时也要注意保暖哦！",
                "雪花轻轻飘落在窗口，等待你观赏最美的舞蹈；寒风呼呼吹响号角，亲爱的${name}，请注意多加衣物哦！").random()

            "MODERATE_SNOW" -> listOf<String>("雪花飞，飞进了平安和健康，雪花降，降临了如意和美满，亲爱的$name，请多加衣物。").random()

            "HEAVY_SNOW" -> listOf<String>("大雪到，北风哮，吹走忧愁无烦恼，大雪到，雪花飘，飘来幸福乐逍遥，亲爱的${name}，注意保暖哦！").random()

            "STORM_SNOW" -> listOf<String>("燕上雪花大如席,纷纷吹落轩辕台，亲爱的${name}，${city}是暴雪天气，注意减少出行哦！").random()

            else -> "$name, hello, 最近过得好吗？"

        }

    }
}